Repository: adehner/CSVExport
Catalog: languages/*.po
Languages: fr

source: Check and save the config of the plugin: there are new options.
fr: Vérifier et sauver la configuration du plugin : plusieurs nouvelles options ont été ajoutées.

source: Item type name
fr: Type de contenu

source: Collection name
fr: Collection

source: Files
fr: Fichiers

source: File sources
fr: Sources des fichiers

source: Tags
fr: Mots-clés

source: Elements
fr: Éléments

source: Metadata to output
fr: Métadonnées exportées

source: Element Sets to include
fr: Jeux de métadonnées à inclure

source: Check the box below to include a given element set in exports.
fr: Cocher la case pour inclure un jeu de métadonnées dans les exports.

source: Header name
fr: Entête

source: Element name only ("Title")
fr: Nom de l'élément seul ("Title")

source: Element set name and element name ("Dublin Core : Title")
fr: Nom du jeu de métadonnées et nom de l'élément ("Dublin Core : Title")

source: This option is useful when there are duplicate element names.
fr: Cette option est utile lorsque des noms d'éléments sont en doublon.

source: Skip Omeka filters
fr: Ne pas appliquer les filtres d'Omeka

source: This option avoids to call the filters of the plugins (in particular fixes compatibility with the plugin SearchByMetadata).
fr: Cette option évite d'appliquer les filtres des plugins (en particulier, cela contourne un problème de compatibilité avec le plugin SearchByMetadata).

source: Return all elements, even unused
fr: Retourner tous les éléments, même non utilisés

source: Return a single value in each column
fr: Retourner une valeur simple dans chaque colonne

source: If checked, each cell will have only one value, so there will be multiple columns for each element.
fr: Lorsque cette option est activée, chaque cellule du tableur aura une seule valeur et il pourra donc y avoir plusieurs colonnes pour chaque élément.

source: Warning: if there are many files, tags and elements by record, the number of columns can be very big and not manageable by spreadsheet software (1024 for LibreOffice, 256 for Excel 2003, 16384 for Excel 2007.
fr: Attention : s'il y a plusieurs fichiers, mots-clés et éléments par document, le nombre de colonnes pourrait être très grand et non gérable par certains tableurs (1024 pour LibreOffice, 256 pour Excel 2003, 16384 pour Excel 2007).

source: There is no issue when the csv is managed by script or with a standard editor.
fr: Il n'y a pas de problème quand le fichier csv est géré par script ou avec un éditeur standard.

source: Replace end of line with carriage return
fr: Remplacer le saut de ligne par un retour chariot

source: If checked, values with multiple lines (generally the Dublin Core description) will be converted into a single line, where the end of line is replaced by a carriage return.
fr: Si coché, les valeurs avec plusieurs lignes (généralement l'élément Dublin Core description) seront converties en une seule ligne, où le saut de ligne est remplacé par un retour chariot.

source: It allows some old spreadsheet softwares to open the file without issue.
fr: Cela permet certains anciens tableurs d'ouvrir le fichier sans erreur.

source: Csv Format
fr: Format csv

source: Delimiter
fr: Délimiteur

source: Comma ,
fr: Virgule ,

source: Semi-colon ;
fr: Point-virgule ;

source: It’s generally recommended to use the tabulation, because it is not used anywhere in metadata.
fr: Il est généralement recommandé d'utiliser des tabulations, car elles ne sont pas utilisées dans les métadonnées.

source: Enclosure
fr: Séparateur

source: Double quote "
fr: Guillemet "

source: Hash #
fr: Dièse #

source: Multivalue separator
fr: Séparateur multivaleurs

source: Unlike delimiter and enclosure, it can have multiple characters.
fr: Contrairement au délimiteur et au séparateur, il peut avoir plusieurs caractères.

source: It is recommended to use a never used string, like " | ".
fr: Il est recommandé d'utiliser une chaîne qui n'est jamais utilisée, comme " | ".

source: Export all data as CSV
fr: Exporter les données en CSV

source: Params can be set in the %sconfig%s of the plugin.
fr: Les paramètres sont définis dans la page de %sconfiguration%s du plugin.
